In [15]:
# Listas : Serie

In [16]:
# Series (array) vs Numpy
# Dataframes (filas y columnas) #Indices y nombres ()
# Paneles (+ 2 dimensiones)

In [17]:
#Estas son las 3 formas para importar una librerias 

import pandas as pd 

import pandas 

from pandas import (

    read_csv,
    read_xml,
    read_excel
)

In [18]:
data = []

In [19]:
df =

SyntaxError: invalid syntax (1581804619.py, line 1)

In [ ]:
#Crear un dataframe desde un diccionario 

data = {
'Nombre' : ['Juan', 'Luis','Julian'],
'Edad' : [25,24,34]
}

df = pd.DataFrame(data)

In [ ]:
df

   Nombre  Edad
0    Juan    25
1    Luis    24
2  Julian    34

In [ ]:
#leer un archivo csv local 
df = pd.read_csv('./utils/data/data.csv')
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [ ]:
df = pd.read_csv('./utils/data/data_without_header',
                 header=None,
                 names= ['Nombre','edad','ciudad']
                 )
df

  Nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [ ]:
#Leer un archivo sin extension con un diferente separador 

df = pd.read_csv('./utils/data/data',
                 
                 sep= '|'
                 )
        

df

  nombre  edad     ciudad
0   Juan   NaN     Madrid
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla

In [ ]:
df = pd.read_json('./utils/data/data.json')
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

METODOS DATAFRAME

In [21]:
df.describe()

       edad
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [24]:
#listar top n elementos
df.head(1)

  nombre  edad  ciudad
0   Juan    25  Madrid

In [25]:
#listar bottom n elementos 
df.tail(2)

  nombre  edad     ciudad
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [26]:
#extraer columns 

df.columns

Index(['nombre', 'edad', 'ciudad'], dtype='object')

In [27]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [28]:
#otra funcion de agrupado 
df.count()

nombre    3
edad      3
ciudad    3
dtype: int64

Acceder valores con dataframe

In [31]:

df['ciudad']

0       Madrid
1    Barcelona
2      Sevilla
Name: ciudad, dtype: object

In [ ]:
#seleccionar una fila por su indice
print(df.loc[2])

print("#####\n")

print()

nombre      Pedro
edad           35
ciudad    Sevilla
Name: 2, dtype: object
#####

Agrupaciones

In [38]:
data = {
    'Grupo': ['A', 'B', 'A', 'A', 'B'],
    'Valor': [12, 34, 23, 45, 33, 33]

}

In [40]:
#leemos la data sin extensiones 
df = pd.read_csv('./utils/data/data', sep = '|')
df

  nombre  edad     ciudad
0   Juan   NaN     Madrid
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla

In [ ]:
#NaN Not a Number (datos numericos faltantes)
#None Ausencia de valor 
#Null "No existe en python" 


#eliminar las filas que contienen vlores desconocidos (Nan)
df_sin_na = df.dropna()
print(df_sin_na)

print("\n")


#Reemplazar NaN con otros valores 
df_completo = df.fillna(value=0)
print(df_completo)

  nombre  edad     ciudad
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla


  nombre  edad     ciudad
0   Juan   0.0     Madrid
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla

FUNCIONES EN UN DATA FRAME

In [49]:
#Dataframe ejemplo
data = {
    'A': [1,2,3,4],
    'B': [6,7,8,9]
}